OpenNuvoton/M0518BSP/Library/StdDriver/src/i2c.c
            case 0x28u:
                if(u32txLen < u32wLen)
                    I2C_SET_DATA(i2c, data[u32txLen++]);
                else
                {
                    u8Ctrl = I2C_I2CON_STO_SI;                   /* Clear SI and send STOP */
                    u8Xfering = 0u;
                }
                break;

            case 0x38u:                                          /* Arbitration Lost */
            default:                                             /* Unknow status */
                u8Ctrl = I2C_I2CON_STO_SI;                       /* Clear SI and send STOP */
                u8Err = 1u;
                break;
        }
        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                        /* Write controlbit to I2C_CTL register */
    }

    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->I2CON & I2C_I2CON_STO_Msk)
    {
        if(--u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32txLen;                                             /* Return bytes length that have been transmitted */
}

/**
  * @brief      Specify two bytes register address and Write a byte to Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u16DataAddr     Specify a address (2 byte) of data write to
  * @param[in]  data            Write a byte data to Slave
  *
  * @retval     0               Write data success
  * @retval     1               Write data fail, or bus occurs error events
  *
  * @details    The function is used for I2C Master specify two bytes address that data write to in Slave.
  *
  * @note       This function sets g_I2C_i32ErrCode to I2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */

uint8_t I2C_WriteByteTwoRegs(I2C_T *i2c, uint8_t u8SlaveAddr, uint16_t u16DataAddr, const uint8_t data)
{
    uint32_t u32txLen = I2C_WriteMultiBytesTwoRegs(i2c, u8SlaveAddr, u16DataAddr, &data, 1);

    if (u32txLen == 1)
    {
        return 0;   /* Write data success */
    }
    else
    {
        return 1;   /* Write data fail, or bus occurs error events */
    }
}


/**
  * @brief      Specify two bytes register address and write multi bytes to Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u16DataAddr     Specify a address (2 bytes) of data write to
  * @param[in]  *data           Pointer to array to write data to Slave
  * @param[in]  u32wLen         How many bytes need to write to Slave
  *
  * @return     A length of how many bytes have been transmitted.
  *
  * @details    The function is used for I2C Master specify a byte address that multi data write to in Slave.
  *
  * @note       This function sets g_I2C_i32ErrCode to I2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */

uint32_t I2C_WriteMultiBytesTwoRegs(I2C_T *i2c, uint8_t u8SlaveAddr, uint16_t u16DataAddr, const uint8_t *data, uint32_t u32wLen)
{
    uint8_t u8Xfering = 1u, u8Err = 0u, u8Addr = 1, u8Ctrl = 0u;
    uint32_t u32txLen = 0u, u32TimeOutCount = 0u;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                                         /* Send START */
    while(u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = I2C_TIMEOUT;
        I2C_WAIT_READY(i2c)
        {
            if(--u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch(I2C_GET_STATUS(i2c))
        {
            case 0x08u:
                I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u | 0x00u));    /* Write SLA+W to Register I2CDAT */
                u8Ctrl = I2C_I2CON_SI;                                      /* Clear SI */
                break;

            case 0x18u:                                                     /* Slave Address ACK */
                I2C_SET_DATA(i2c, (uint8_t)(u16DataAddr & 0xFF00u) >> 8u);  /* Write Hi byte address of register */
                break;

            case 0x20u:                                                     /* Slave Address NACK */
            case 0x30u:                                                     /* Master transmit data NACK */
                u8Ctrl = I2C_I2CON_STO_SI;                                  /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x28u:
                if(u8Addr)
                {
                    I2C_SET_DATA(i2c, (uint8_t)(u16DataAddr & 0xFFu));      /* Write Lo byte address of register */
                    u8Addr = 0;
                }
                else if((u32txLen < u32wLen) && (u8Addr == 0u))
                    I2C_SET_DATA(i2c, data[u32txLen++]);                    /* Write data to Register I2CDAT*/
                else
                {
                    u8Ctrl = I2C_I2CON_STO_SI;                              /* Clear SI and send STOP */
                    u8Xfering = 0u;
                }                 
                break;

            case 0x38u:                                                     /* Arbitration Lost */
            default:                                                        /* Unknow status */
                u8Ctrl = I2C_I2CON_STO_SI;                                  /* Clear SI and send STOP */                  
                u8Err = 1u;
                break;
        }
        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                                   /* Write controlbit to I2C_CTL register */ 
    }

    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->I2CON & I2C_I2CON_STO_Msk)
    {
        if(--u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32txLen;                                                        /* Return bytes length that have been transmitted */
}

/**
  * @brief      Read a byte from Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  *
  * @return     Read a byte data from Slave
  *
  * @details    The function is used for I2C Master to read a byte data from Slave.
  *
  * @note       This function sets g_I2C_i32ErrCode to I2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */
uint8_t I2C_ReadByte(I2C_T *i2c, uint8_t u8SlaveAddr)
{
    uint8_t data;

    uint32_t u32rxLen = I2C_ReadMultiBytes(i2c, u8SlaveAddr, &data, 1);

    if (u32rxLen == 1)
    {
        return data;
    }
    else
    {
        return 0;   /* Read data fail */
    }
}


/**
  * @brief      Read multi bytes from Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[out] *rdata          Point to array to store data from Slave
  * @param[in]  u32rLen         How many bytes need to read from Slave
  *
  * @return     A length of how many bytes have been received
  *
  * @details    The function is used for I2C Master to read multi data bytes from Slave.
  *
  * @note       This function sets g_I2C_i32ErrCode to I2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */
uint32_t I2C_ReadMultiBytes(I2C_T *i2c, uint8_t u8SlaveAddr, uint8_t *rdata, uint32_t u32rLen)
{
    uint8_t u8Xfering = 1u, u8Err = 0u, u8Ctrl = 0u;
    uint32_t u32rxLen = 0u, u32TimeOutCount = 0u;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                                /* Send START */
    while(u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = I2C_TIMEOUT;
        I2C_WAIT_READY(i2c)
        {
            if(--u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch(I2C_GET_STATUS(i2c))
        {
            case 0x08u:
                I2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1u) | 0x01u));   /* Write SLA+R to Register I2CDAT */
                u8Ctrl = I2C_I2CON_SI;                              /* Clear SI */
                break;

            case 0x40u:                                             /* Slave Address ACK */
                if (u32rLen == 1)
                {
                    u8Ctrl = I2C_I2CON_SI;                          /* Clear SI */
                }
                else
                {
                    u8Ctrl = I2C_I2CON_SI_AA;                       /* Clear SI and set ACK */
                }
                break;

            case 0x48u:                                             /* Slave Address NACK */
                u8Ctrl = I2C_I2CON_STO_SI;                          /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x50u:
                rdata[u32rxLen++] = (unsigned char) I2C_GET_DATA(i2c);  /* Receive Data */
                if (u32rxLen < (u32rLen - 1u))
                {
                    u8Ctrl = I2C_I2CON_SI_AA;                       /* Clear SI and set ACK */
                }
                else
                {
                    u8Ctrl = I2C_I2CON_SI;                          /* Clear SI */
                }
                break;

            case 0x58u:
                rdata[u32rxLen++] = (unsigned char) I2C_GET_DATA(i2c);  /* Receive Data */
                u8Ctrl = I2C_I2CON_STO_SI;                          /* Clear SI and send STOP */
                u8Xfering = 0u;
                break;

            case 0x38u:                                             /* Arbitration Lost */
            default:                                                /* Unknown status */
                u8Ctrl = I2C_I2CON_STO_SI;                          /* Clear SI and send STOP */
                u8Err = 1u;
                break;
        }
        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                           /* Write controlbit to I2C_CTL register */
    }

    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->I2CON & I2C_I2CON_STO_Msk)
    {
        if(--u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32rxLen;                                                /* Return bytes length that have been received */
}


/**
  * @brief      Specify a byte register address and read a byte from Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u8DataAddr      Specify a address(1 byte) of data read from
  *
  * @return     Read a byte data from Slave
  *
  * @details    The function is used for I2C Master specify a byte address that a data byte read from Slave.
  *
  * @note       This function sets g_I2C_i32ErrCode to I2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */
uint8_t I2C_ReadByteOneReg(I2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr)
{
    uint8_t data;

    uint32_t u32rxLen = I2C_ReadMultiBytesOneReg(i2c, u8SlaveAddr, u8DataAddr, &data, 1);

    if (u32rxLen == 1)
    {
        return data;
    }
    else
    {
        return 0;   /* Read data fail */
    }
}

/**
  * @brief      Specify a byte register address and read multi bytes from Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u8DataAddr      Specify a address (1 bytes) of data read from
  * @param[out] *rdata          Point to array to store data from Slave
  * @param[in]  u32rLen         How many bytes need to read from Slave
  *
  * @return     A length of how many bytes have been received
  *
  * @details    The function is used for I2C Master specify a byte address that multi data bytes read from Slave.
  *
  * @note       This function sets g_I2C_i32ErrCode to I2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */
uint32_t I2C_ReadMultiBytesOneReg(I2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr, uint8_t *rdata, uint32_t u32rLen)
{
    uint8_t u8Xfering = 1u, u8Err = 0u, u8Ctrl = 0u;
    uint32_t u32rxLen = 0u, u32TimeOutCount = 0u;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                                /* Send START */
    while(u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = I2C_TIMEOUT;
        I2C_WAIT_READY(i2c)
        {
            if(--u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch(I2C_GET_STATUS(i2c))
        {
            case 0x08u:
                I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u | 0x00u));    /* Write SLA+W to Register I2CDAT */
                u8Ctrl = I2C_I2CON_SI;                              /* Clear SI */
                break;

            case 0x18u:                                             /* Slave Address ACK */
                I2C_SET_DATA(i2c, u8DataAddr);                      /* Write Lo byte address of register */
                break;

            case 0x20u:                                             /* Slave Address NACK */
            case 0x30u:                                             /* Master transmit data NACK */
                u8Ctrl = I2C_I2CON_STO_SI;                          /* Clear SI and send STOP */
                u8Err = 1u;
                break;

