OpenNuvoton/M0518BSP/Library/StdDriver/src/i2c.c
            case 0x28u:
                u8Ctrl = I2C_I2CON_STA_SI;                          /* Send repeat START */
                break;

            case 0x10u:
                I2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1u) | 0x01u));  /* Write SLA+R to Register I2CDAT */
                u8Ctrl = I2C_I2CON_SI;                              /* Clear SI */
                break;

            case 0x40u:                                             /* Slave Address ACK */
                if (u32rLen == 1)
                {
                    u8Ctrl = I2C_I2CON_SI;                          /* Clear SI */
                }
                else
                {
                    u8Ctrl = I2C_I2CON_SI_AA;                       /* Clear SI and set ACK */
                }
                break;

            case 0x48u:                                             /* Slave Address NACK */
                u8Ctrl = I2C_I2CON_STO_SI;                          /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x50u:
                rdata[u32rxLen++] = (uint8_t) I2C_GET_DATA(i2c);    /* Receive Data */
                if (u32rxLen < (u32rLen - 1u))
                    u8Ctrl = I2C_I2CON_SI_AA;                       /* Clear SI and set ACK */
                else
                    u8Ctrl = I2C_I2CON_SI;                          /* Clear SI */
                break;

            case 0x58u:
                rdata[u32rxLen++] = (uint8_t) I2C_GET_DATA(i2c);    /* Receive Data */
                u8Ctrl = I2C_I2CON_STO_SI;                          /* Clear SI and send STOP */
                u8Xfering = 0u;
                break;

            case 0x38u:                                             /* Arbitration Lost */
            default:                                                /* Unknow status */
                u8Ctrl = I2C_I2CON_STO_SI;                          /* Clear SI and send STOP */
                u8Err = 1u;
                break;
        }
        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                           /* Write controlbit to I2C_CTL register */
    }

    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->I2CON & I2C_I2CON_STO_Msk)
    {
        if(--u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32rxLen;                                               /* Return bytes length that have been received */
}

/**
  * @brief      Specify two bytes register address and read a byte from Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u16DataAddr     Specify a address(2 byte) of data read from
  *
  * @return     Read a byte data from Slave
  *
  * @details    The function is used for I2C Master specify two bytes address that a data byte read from Slave.
  *
  * @note       This function sets g_I2C_i32ErrCode to I2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */
uint8_t I2C_ReadByteTwoRegs(I2C_T *i2c, uint8_t u8SlaveAddr, uint16_t u16DataAddr)
{
    uint8_t data;

    uint32_t u32rxLen = I2C_ReadMultiBytesTwoRegs(i2c, u8SlaveAddr, u16DataAddr, &data, 1);

    if (u32rxLen == 1)
    {
        return data;
    }
    else
    {
        return 0;   /* Read data fail */
    }
}

/**
  * @brief      Specify two bytes register address and read multi bytes from Slave
  *
  * @param[in]  *i2c            Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u16DataAddr     Specify a address (2 bytes) of data read from
  * @param[out] *rdata          Point to array to store data from Slave
  * @param[in]  u32rLen         How many bytes need to read from Slave
  *
  * @return     A length of how many bytes have been received
  *
  * @details    The function is used for I2C Master specify two bytes address that multi data bytes read from Slave.
  *
  * @note       This function sets g_I2C_i32ErrCode to I2C_ERR_TIMEOUT if waiting I2C time-out.
  *
  */
uint32_t I2C_ReadMultiBytesTwoRegs(I2C_T *i2c, uint8_t u8SlaveAddr, uint16_t u16DataAddr, uint8_t *rdata, uint32_t u32rLen)
{
    uint8_t u8Xfering = 1u, u8Err = 0u, u8Addr = 1, u8Ctrl = 0u;
    uint32_t u32rxLen = 0u, u32TimeOutCount = 0u;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                                         /* Send START */
    while(u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = I2C_TIMEOUT;
        I2C_WAIT_READY(i2c)
        {
            if(--u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch(I2C_GET_STATUS(i2c))
        {
            case 0x08u:
                I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u | 0x00u));    /* Write SLA+W to Register I2CDAT */
                u8Ctrl = I2C_I2CON_SI;                                      /* Clear SI */
                break;

            case 0x18u:                                                     /* Slave Address ACK */
                I2C_SET_DATA(i2c, (uint8_t)(u16DataAddr & 0xFF00u) >> 8u);  /* Write Hi byte address of register */
                break;

            case 0x20u:                                                     /* Slave Address NACK */
            case 0x30u:                                                     /* Master transmit data NACK */
                u8Ctrl = I2C_I2CON_STO_SI;                                  /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x28u:
                if(u8Addr)
                {
                    I2C_SET_DATA(i2c, (uint8_t)(u16DataAddr & 0xFFu));      /* Write Lo byte address of register */
                    u8Addr = 0;
                }
                else
                    u8Ctrl = I2C_I2CON_STA_SI;                              /* Clear SI and send repeat START */
                break;

            case 0x10u:
                I2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1u) | 0x01u));  /* Write SLA+R to Register I2CDAT */
                u8Ctrl = I2C_I2CON_SI;                                      /* Clear SI */
                break;

            case 0x40u:                                                     /* Slave Address ACK */
                if (u32rLen == 1)
                {
                    u8Ctrl = I2C_I2CON_SI;                                  /* Clear SI */
                }
                else
                {
                    u8Ctrl = I2C_I2CON_SI_AA;                               /* Clear SI and set ACK */
                }
                break;

            case 0x48u:                                                     /* Slave Address NACK */
                u8Ctrl = I2C_I2CON_STO_SI;                                  /* Clear SI and send STOP */
                u8Err = 1u;
                break;

            case 0x50u:
                rdata[u32rxLen++] = (unsigned char) I2C_GET_DATA(i2c);      /* Receive Data */
                if (u32rxLen < (u32rLen - 1))
                    u8Ctrl = I2C_I2CON_SI_AA;                               /* Clear SI and set ACK */
                else
                    u8Ctrl = I2C_I2CON_SI;                                  /* Clear SI */
                break;

            case 0x58u:
                rdata[u32rxLen++] = (unsigned char) I2C_GET_DATA(i2c);      /* Receive Data */
                u8Ctrl = I2C_I2CON_STO_SI;                                  /* Clear SI and send STOP */
                u8Xfering = 0u;
                break;

            case 0x38u:                                                     /* Arbitration Lost */
            default:                                                        /* Unknow status */
                u8Ctrl = I2C_I2CON_STO_SI;                                  /* Clear SI and send STOP */
                u8Err = 1u;
                break;
        }
        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                                   /* Write controlbit to I2C_CTL register */
    }
    
    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->I2CON & I2C_I2CON_STO_Msk)
    {
        if(--u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32rxLen;                                                        /* Return bytes length that have been received */
}

/*@}*/ /* end of group M0518_I2C_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NU131_I2C_Driver */

/*@}*/ /* end of group M0518_Device_Driver */

/*** (C) COPYRIGHT 2014 Nuvoton Technology Corp. ***/
